{
    "title": "Numbers with Heart: My Journey from Actuarial Tables to Social Impact.",
    "subtitle": "Picture an ex-actuary who left risk tables behind to transform social services—and now wields Python, SQL, and AI to tackle real-world challenges. From building e-commerce dashboards to fine-tuning Transformer models, I bring curiosity, empathy, and an unshakeable drive to innovate. If your team needs a data pro who blends finance-savvy, passion for people, and cutting-edge tech to unleash game-changing insights, I’m ready to make that happen. Let’s harness data—and human dedication—to create meaningful impact together.",
    "social_links": {
        "linkedin": "https://www.linkedin.com/in/fehmi-dataanalyst",
        "github": "https://github.com/Rojhak"
    },
    "profile_image": "fehmi.jpg",
    "projects": [
        {
            "title": "BundesRAG Analytics",
            "description": "A comprehensive analysis system for German parliamentary speeches (2000-2022) powered by Retrieval-Augmented Generation (RAG). This cutting-edge platform combines FAISS vector search, SentenceTransformers, and spaCy to transform parliamentary discourse into actionable insights, enabling intelligent exploration and analysis of political discussions.",
            "image": "bundestag.png",
            "link": "https://github.com/Rojhak/BundesRAG-Analytics",
            "type": "github",
            "features": [
                "🔍 Semantic Search: Advanced context-aware search beyond keywords using FAISS and SentenceTransformers",
                "📊 Real-time Analytics: Dynamic visualization of political trends and party analysis",
                "🎯 Topic Tracking: AI-powered extraction and analysis of topic evolution across time and parties",
                "🔄 RAG Pipeline: Smart context extraction combining retrieval-based and generative approaches",
                "🌐 Multilingual Support: Full support for German and English interfaces",
                "📈 Interactive Dashboard: Real-time data exploration and visualization",
                "👥 Speaker Analysis: Track contributions and themes across parliamentarians"
            ],
            "tech_stack": [
                "Python",
                "Streamlit",
                "Hugging Face",
                "FAISS",
                "spaCy",
                "SentenceTransformers"
            ]
        },
        {
            "title": "Bitcoin Analysis System",
            "description": "Developed an automated system using AWS Lambda functions to track Bitcoin prices, collect news, and perform sentiment analysis using Hugging Face LLMs. Includes real-time data pipeline with PostgreSQL integration.",
            "image": "aws.png",
            "link": "https://github.com/Rojhak/bitcoin-analysis-aws_lambda-api-llm",
            "features": [
                "Automated data pipeline for Bitcoin price tracking",
                "News scraping with sentiment analysis",
                "AWS Lambda serverless architecture",
                "Railway PostgreSQL database integration",
                "Hugging Face Transformers for NLP"
            ],
            "technologies": [
                "AWS Lambda",
                "Python 3.10",
                "PostgreSQL",
                "Hugging Face API",
                "Web Scraping"
            ]
        },
        {
            "title": "Sales Analytics Dashboard",
            "description": "Interactive Tableau dashboard providing comprehensive sales analysis with dynamic filtering and real-time visualization capabilities.",
            "image": "tableau.jpg",
            "link": "https://public.tableau.com/app/profile/fehmi.katar/viz/BAProject_dasboard/SalesDashboard",
            "type": "tableau",
            "embed_url": "https://public.tableau.com/views/BAProject_dasboard/SalesDashboard?:showVizHome=no&:embed=true",
            "features": [
                "Dynamic sales metrics visualization",
                "Interactive filtering capabilities",
                "Real-time data updates",
                "Multi-dimensional analysis"
            ]
        },
        {
            "title": "Project Presentations",
            "description": "Collection of detailed project presentations and technical documentation showcasing various data analysis and machine learning implementations.",
            "image": "slides.png",
            "link": "/project_slides",
            "type": "slides",
            "features": [
                "Comprehensive project documentation",
                "Technical implementation details",
                "Data analysis methodologies",
                "Machine learning approaches",
                "Visual results and insights"
            ],
            "tech_stack": [
                "Python",
                "Machine Learning",
                "Data Analysis",
                "Visualization",
                "Documentation"
            ]
        }
    ],
    "about": {
        "name": "FEHMI KATAR",
        "title": "Data Analyst",
        "location": "Berlin, Germany",
        "contact": {
            "email": "katar.fhm@gmail.com",
            "phone": "017663036672",
            "linkedin": "www.linkedin.com/in/fehmi-dataanalyst"
        },
        "expertise": "Results-driven Data Analyst with over seven years of leadership experience and a strong foundation in risk management. Holds a degree in Actuarial Sciences, combining expertise in finance, mathematics, and statistics to drive data-informed strategies. Expert in data-oriented consulting, leveraging SQL, Python, R, and Tableau to transform complex data into actionable insights.",
        "skills": {
            "Python": "Data manipulation, machine learning, and predictive modeling using libraries like Pandas, Spacy, NumPy, and Scikit-learn.",
            "SQL": "Data querying, database management, complex joins; proficient in writing optimized queries.",
            "Tableau": "Data visualization, dashboard creation, and storytelling with data; experienced in creating interactive dashboards.",
            "Git": "Collaboration on code projects, version control, and workflow management using Git.",
            "AI & NLP": "AI tools like Transformers and Hugging Face for NLP tasks, including text classification, sentiment analysis, and model fine-tuning.",
            "Cloud": "AWS Lambda, Railway, Streamlit"
        },
        "experience": [
            {
                "title": "Data-Driven Asylum Rights Management",
                "company": "Yekmal e.V. Berlin, Germany",
                "period": "04/2016-12/2023",
                "details": [
                    "Co-founded and led an asylum and residence rights department",
                    "Collected, analyzed, and presented data on clients, court decisions, immigration statistics",
                    "Implemented data-driven strategies to improve consulting services"
                ]
            }
        ],
        "education": [
            {
                "degree": "Advanced Data Analytics & Machine Learning - Immersive Course",
                "school": "Code Academy Berlin",
                "period": "06/2024 - 12/2024"
            },
            {
                "degree": "Intensive Coding Program: Piscine & Full Cycle",
                "school": "42 Berlin",
                "period": "03/2024 - 07/2024"
            },
            {
                "degree": "Bachelor of Science in Actuarial Science",
                "school": "Marmara Üniversitesi-Istanbul, Turkey",
                "period": "03/2004 - 08/2008"
            }
        ],
         "certifications": [
            "Data Science with Python - SkillUP by Simplilearn (2023)",
            "Google Data Analyst (2023)"
        ],
        "languages": ["German (C2)", "English (C1)", "Turkish (Native)", "Kurdish (Native)"]
       
    }
} 